[{"title":"复制Array数组的正确姿势","date":"2017-04-01T14:35:00.000Z","path":"2017/04/01/复制Array数组的正确姿势/","text":"引子我们先假设有这样一个数组： var arr = [&apos;one&apos;, &apos;two&apos;, &apos;three&apos;] 然后再申明var arr2 = arr ，诚然此时arr2算是复制了一个和arr一样的数组，好像没什么问题。但是当我们执行arr2.pop()方法后再来看看，两个数组都变成了[‘one’, ‘two’]，这并不是我们所希望看到的结果。我们希望复制后的两个数组可以各行其是，独行于世。 for循环复制数组比较传统的做法就是使用for循环arr数组得到arr2数组，这样我们就成功复制数组arr，得道了一个新的独立的数组arr2，再次验证arr2.pop()方法，并没有对arr数组产生影响。 var arr = [&apos;one&apos;, &apos;two&apos;, &apos;three&apos;]； var arr2 = []; for(var i=0;i&lt;arr.length;i++){ arr2[i]=arr[i]; } arr2.pop()； console.log(arr,arr2) // [&apos;one&apos;, &apos;two&apos;, &apos;three&apos;],[&apos;one&apos;, &apos;two&apos;] Array.from()方法复制数组Array.from()是ES6中新增的数组方法，这个方法的作用是从一个数组或具有数组某些行为的对象中生成一个新的数组。代码示例： /*从一个数组生成新数组*/ var arr = [&apos;one&apos;, &apos;two&apos;, &apos;three&apos;]； var arr2 = Array.from(arr); arr2.pop()； console.log(arr,arr2) // [&apos;one&apos;, &apos;two&apos;, &apos;three&apos;],[&apos;one&apos;, &apos;two&apos;] ／*从具有数组某些行为的对象中生成新数组*／ var imgs = Array.from(document.querySelectorAll(&apos;img&apos;)); …扩展运算符…是ES6新增的扩展运算符，它将一个数组转化为用逗号分隔的参数序列。代码示例： var arr = [&apos;one&apos;, &apos;two&apos;, &apos;three&apos;]； var arr2 = [...arr]; arr2.pop()； console.log(arr,arr2) // [&apos;one&apos;, &apos;two&apos;, &apos;three&apos;],[&apos;one&apos;, &apos;two&apos;] 此运算符主要用于函数调用： function show(...args){ args.push(6); } show(1,2,3,4,5) //1,2,3,4,5,6","tags":[{"name":"javascript","slug":"javascript","permalink":"http://renpingjun.cn/tags/javascript/"}]},{"title":"科目一重要考點梳理（四）","date":"2017-03-26T06:52:00.000Z","path":"2017/03/26/科目一重要考點梳理（四）/","text":"一 考试知识点答题技巧1.答题中所有题一个原则——安全，因此怎么做安全就怎么做。2.判断题中遇到紧急情况所有过激行为都错，比如急踩（用力踏）油门（制动），急转方向，选择题中类似的答案都错。3.能让行的都让行，能帮助的都帮助，能避让就避让，只要不抢、不急都对。4.抢救伤员一个原则先救人，救人一个原则先止血。5.无标志无灯无警路口，按照让右路——让左转——让直行的顺序判断。6.车辆变换位置都要开转向灯，唯一一个不开的就是进环岛（转盘）。7.红色是禁令、黄色是警告、蓝色是指示，三种颜色都没有是辅助。8.禁令对禁止、警告对警告、指示对指示，相同就对，不相同就错。9.黄灯亮与黄灯闪烁只一字之差。“闪烁”确保安全，“亮”不准通行，但越线的可通行。10.远光灯、近光灯的考题只能使用近光灯，不准使用远光灯。11.只有冰雪道路是下坡先行，其余都是上坡先行；如果出现两个上坡先行，就选字多的。12.有省选省，无省选县。13.户籍地对户籍地，暂住地对暂住地。 二 易错知识点答题技巧1.可以：实习驾驶员不得单独驾车上高速，须有3年驾龄的驾驶员陪同才能上高速。2.不准：牵引车辆;驾驶特种和危险品车辆;单独驾驶大客车和挂车。3.可以：鸣三次，鸣半秒钟。行车中遇到畜力车时，尽量少鸣喇叭。4.不准：郊外高音喇叭禁止，晚上23时到凌晨5时禁止。当经过不允许鸣喇叭的路段时，注意安全，禁止鸣喇叭。行进没有禁止鸣喇叭路段时，驾驶人应该尽可能少鸣喇叭。5.高架和高速：不准停车、调头、逆向行驶、上下客。 三 难题知识点解答技巧1、选择题、判断题带有这些字样的都是正确的：不能、不得、不准、不要、停车避让、减速让行、依次排队等候、系好安全带、及时、保护现场、间断轻踏、靠右行驶、按顺序。带有这些字样的都是错误的：马上、迅速、加速、不予避让、紧急制动、降低胎压、空挡滑行。2、停车停车应该停在规定停车区域内。路边临时停车不能妨碍交通。30米内不得停车：加油站、急救站、公交车站、消防栓、消防队门口。50米内不得停车：窄路、急弯、隧道、铁道路口、桥梁、陡坡、交叉路口。","tags":[{"name":"科目一","slug":"科目一","permalink":"http://renpingjun.cn/tags/科目一/"}]},{"title":"科目一重要考點梳理（三）","date":"2017-03-26T05:52:00.000Z","path":"2017/03/26/科目一重要考點梳理（三）/","text":"日期類答題技巧1.事故后逃逸，不构成犯罪，并处15日以下拘留。2.小型车非营运从注册登记之日起，6年以内每2年检验1次。3.小型车非营运从注册登记之日起，超过6年不满15年的，每1年检验一次。4.初次申领驾驶证后的12个月为实习期。5.机动车驾驶证有效期分为6年、10年和长期。6.道路交通安全违法行为累积记分周期为12个月。7.驾驶人不得连续驾驶超过4小时未停车休息。8.驾驶人连续驾车超过4小时，停车休息时间不得少于20分钟。9.以不正当手段取得机动车登记或者驾驶许可的，撤销，申请人3年内不得再申请。10.被扣留的机动车30日内不接受处理，公告3个月仍不接受处理的，依法拍卖。11.机动车驾驶人发生重大事故构成犯罪的，处3年以下有期徒刑。12.机动车驾驶人逃逸，处3年以上7年以下有期徒刑。13.公安交警需要调查核实机动车来历证明的，30日内不来接受处理，不受扣留机动车时间限制。14.当事人未在事故现场报警，事后请求处理的，应当在提出请求后10日内提供证据。15.请求交警部门调解损害赔偿的，可以在收到事故认定书之日起10日内提出书面申请。16.调解参加人因故不能按期参加调解的，应提前24小时通知交警，请求变更时间。17.吊销驾驶证未满2年的不得申请驾驶证。18.撤销驾驶许可未满3年的不得申请驾驶证。19.小型申请增加大型货车准驾车型的，应当在申请前最近1个周期内没有满分记录。20.申请机动车驾驶证考试，每个科目考试1次，可以补考1次。21.应当于驾驶证有效期满90日内，向核发地申请换证。22.超过驾驶证有效期1年以上未换证的，应当注销其驾驶证。23.一个周期内记分达到12分的，应当接受为期七日的教育。24.年龄在60周岁以上，应当每1年提交一次身体检查。25.年龄在60周岁以上的，在记分周期结束后15天内，提交身体条件的证明。（各地实际执行时间情况不统一。）26.驾驶证记载的信息发生变化的，应当在30日内申请换证。27.机动车交通事故责任强制保险的保险期间为1年。28.一年内有醉酒的行为，被处罚两次以上的，吊销驾驶证，5年内不准驾驶营运机动车。29.大型、中型非营运机动车从注册登记之日起，10年内每年检验1次。30.大型、中型非营运机动车从注册登记之日起，超过10年的，每6个月检验1次。31.载客汽车从注册登记之日起，5年内每年检验1次。32.载客汽车从注册登记之日起，超过5年的，每6个月检验1次。33.申请增加大型客车准驾车型的，应当取得中型客车或者大型货车资格5年以上。34.申请增加大型客车准驾车型的，应当在申请前最近连续3个记分周期内没有满分记录。35.取得驾驶牵引车准驾车型资格2年以上，可以申请增加大型客车。36.持有大客、公交、中客驾驶证的，在1个记分周期结束后，1年内未提交体检证明的，注销驾驶证。37.载货汽车从注册登记之日起，10年以内每年检验1次。38.载货汽车从注册登记之日起，超过10年的，每6个月检验1次。39.载货汽车从注册登记之日起，超过10年的，每年检验2次。40.年龄在60周岁以上或者持有牵引车、大货驾驶证的，在1个记分周期结束后，1年内未提交体检证明，注销驾驶证。","tags":[{"name":"科目一","slug":"科目一","permalink":"http://renpingjun.cn/tags/科目一/"}]},{"title":"科目一重要考點梳理（二）","date":"2017-03-23T12:35:00.000Z","path":"2017/03/23/科目一重要考點梳理（二）/","text":"一 機動車讓行 轉彎讓直行 右轉讓左轉 右方先行 二 機動車行駛速度 普通公路 無中心線：城30公40； 有中心線：城50公70； 限速30：遇雨雪沙塵暴等天氣，能見度低於50m；掉頭、轉彎、下坡；在冰雪、泥濘道路上；牽引故障車時；進出非機動車道，鐵道口，窄路齋橋等。 高速公路 兩車道：60～100，100～120 三車道：60～90，90～110，110～120","tags":[{"name":"科目一","slug":"科目一","permalink":"http://renpingjun.cn/tags/科目一/"}]},{"title":"科目一重要考點梳理（一）","date":"2017-03-23T11:35:00.000Z","path":"2017/03/23/科目一重要考點梳理（一）/","text":"一 道路交通安全違法行為記12分 駕駛與准假車型不符的機動車 飲酒後駕駛機動車 造成交通事故後逃逸，尚不構成犯罪 上道路行駛的機動車未懸掛機動車牌 故意遮擋、污損、不按規定安裝機動車牌 使用偽造、變造的機動車牌、行駛證、駕駛證 使用其他機動車號牌、行駛證 駕駛機動車在高速公路上倒車、逆行、掉頭 駕駛機動車超過規定時速50% 二 道路交通安全違法行為記6分 機動車駕駛證被扣期間駕駛機動車 駕駛機動車違反道路交通信號燈通行 駕駛機動車超過規定時速20% 駕駛貨車載物超過核定載質量30%或違反規定載客 駕駛機動車在高速公路車道內停車 駕駛機動車違法佔用應車道行駛 低能見度天氣條件下，駕駛機動車在高速公路上不按規定行駛 以隱瞞、欺騙手段補領機動車駕駛證 不按規定避讓校車 駕駛機動車超過4小時未休息或休息時間小於20分鐘 三 違反交通運輸管理法規刑罰 因發生重大交通事故，致人重傷、死亡或者使公私財產遭受重大損失的，處3年以下有期徒刑或拘役 交通運輸肇事後逃逸或者尤其他特別惡劣情節的，處3～7年有期徒刑 因逃逸致人死亡的，處7年以上有期徒刑 四 機動車在高速上行駛速度及車距 能見度小於200m：開啟霧燈、近光燈、示廓燈和前後位燈；車速&lt;60km／h ；車距100m以上 能見度小於100m：開啟霧燈、近光燈、示廓燈、前後位燈和危險報警閃光燈；車速&lt;40km／h ；車距50m以上 能見度小於50m：開啟霧燈、近光燈、示廓燈、前後位燈和危險報警閃光燈；車速&lt;20km／h ；從最近出口儘快駛離高速公路","tags":[{"name":"科目一","slug":"科目一","permalink":"http://renpingjun.cn/tags/科目一/"}]},{"title":"函数绑定","date":"2017-03-13T13:35:00.000Z","path":"2017/03/13/函数绑定/","text":"函数绑定需要创建一个函数，可以在特定的this环境中以指定参数调用另一个函数，常和回调函数、事件处理程序一起使用，以便在将函数作为变量传递的同时不改变函数执行环境。 我们来看下面这个例子： 1234567891011121314151617181920212223242526272829303132333435var lottery = &#123; dialog: &#123; getGoods: \"iphone 7\", getVoucher: \"100\", getNone: \"nothing\", noChance: \"no chance\" &#125;, bindEvent: function () &#123; $(\"#lottery-btn\").on('click', function () &#123; $('#lottery_canvas').addClass('runanimation'); $.ajax(&#123; type: \"get\", url: \"ajaxUrl\", dataType: \"json\", success: function (data) &#123; if (data.msg == \"success\") &#123; switch (data.status) &#123; case 0 : this.dialog.getNone; break; case 1 : this.dialog.noChance; break; case 2 : this.dialog.getVoucher; break; case 3 : this.dialog.getGoods; break; &#125; &#125; &#125;); &#125;) &#125; &#125; 在这个例子中，我创建了一个lottery对象，lottery.bindEvent()方法被分配到一个id为lottery-btn的DOM结构上。按下按钮时，调用该函数，转盘转动，发送ajax请求，根据返回的值做不同的处理。","tags":[{"name":"javascript","slug":"javascript","permalink":"http://renpingjun.cn/tags/javascript/"}]},{"title":"How to Build Your Personal Blog in Half an Hour ?","date":"2017-03-12T13:59:00.000Z","path":"2017/03/12/How-to-Build-Your-Personal-Blog-in-Half-an-Hour/","text":"Initialize Your Work EnvironmentIn order to build your blog more quickly and successfully, you’d better install some software mentioned below. Node &amp;&amp; NPMIt is used to generate static pages. We use the Homebrew to install node, which is the missing package manager for macOS. 1$ brew install node Git1$ brew install git GithubYou need to apply for an account in github to manage your own code. Use HexoHexo is a fast, simple &amp; powerful blog framework. Install Hexo in global environment1$ npm install -g hexo create a directory and init hexo123$ mkdir blog$ cd blog$ hexo init Now you have actrually down your installation work. generate static pages.1$ hexo generate or1$ hexo g Start local service1$ hexo server Open your broswer and input localhost:4000 in address blank.","tags":[]},{"title":"Hello World","date":"2017-03-12T11:30:33.000Z","path":"2017/03/12/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]}]